
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11876048690)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 7 to change, 4 to destroy.</code></pre>

* Create
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
* Update
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "dyson-rs/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                              = "dyson-rs/.github/pull_request_template.md"
        # (11 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "b6cde762ac475754edf60a50116aa07f87f21f55" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:11" -> (known after apply)
      ~ labels                = [
          - "documentation",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 11 -> (known after apply)
      ~ opened_at             = 1731818012 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818023 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5cc937a63844a086691695303161c7ae382336d9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "fd7d586ada1de406cd6e60c7ede7c74761978882" -> (known after apply)
      ~ id                    = "hayas1:json-with-comments:46" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 46 -> (known after apply)
      ~ opened_at             = 1731818015 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818026 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                              = "tfgh/.github/pull_request_template.md"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "35a183fc52dd96d139c9708b743142e22815b0a9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "58dd8ea11b67ee57a79eb5169e8c400a0fe6d412" -> (known after apply)
      ~ id                    = "hayas1:tfgh:75" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "manual",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 75 -> (known after apply)
      ~ opened_at             = 1731818013 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731818510 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
          + <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d0b3dbb3471c681e30c750be2eba289e1e17593e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "51f046fcff222e92b0727d38895bffb020c7308a" -> (known after apply)
      ~ id                    = "hayas1:tokei-toukei:27" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 27 -> (known after apply)
      ~ opened_at             = 1731818019 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731818030 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 7 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"94e1c53411a9718b6a378eccd0853cad242a2dbb1f0177fcb6658cd8be2185eb\"" -> "W/\"9d087533ff377010fdfe49b0cf458e8bddb8162d16d6970eb9b3782d4693737e\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4a14b9003b2e588f5dd39e5e8b8679eee39333bc48aeb67ecd5039f0829c92f6\"" -> "W/\"9f54f570bfe1e3cdc65b53972c43b5850c8b0b88bcf518c746fc0fc893c949d0\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"eaa9dfd2282d066137c77033b9b5d8bbb0be1b2fb6a30f570dd51bb0cb0cb380\"" -> "W/\"db2c67825f5f8540600eed7f5709a181b01dc3b203832eb00b1f51d6fd6e00fc\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"42627156b1e129b54b422a821a3f7f75a81f94db0d6083050820c0194cffef4d\"" -> "W/\"e86c22af7e5ddc4f403cb28478af886175ba4953ce4cd17faafd824e79edeba8\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"c2a00d154f4ca8efb94abffac561ea688854ade452fdb16b5d450042cddf0355\"" -> "W/\"28fdf6fd4a5abead28ef38bda7a95dc18bc48367f0c0cba5e6d7b6cd96a2b1dd\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":77,"Program":"tfcmt","SHA1":"029303d54ed7cff531247ca8e0e2edb4788151cb","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->